test/load/graphql-test.yml
config:
  target: 'https://api-pasteleria.vercel.app'
  phases:
    - duration: 60
      arrivalRate: 50
      name: "GraphQL load test"

  variables:
    adminEmail: "ariadna.admin@pasteleria.com"
    adminPassword: "AdminSecurePass123!"

scenarios:
  - name: "GraphQL Queries"
    weight: 100
    flow:
      # Login para obtener token
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Query GraphQL para productos
      - post:
          url: "/graphql"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            query: |
              query GetProducts {
                products {
                  id
                  name
                  price
                  description
                }
              }
          expect:
            - statusCode: 200
      
      # Query más compleja
      - post:
          url: "/graphql"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          json:
            query: |
              query GetProductById($id: ID!) {
                product(id: $id) {
                  id
                  name
                  price
                  category {
                    name
                  }
                }
              }
            variables:
              id: "1"
          expect:
            - statusCode: 200